contiki-ng/contiki-ng/arch/cpu/m2354/StdDriver/src/rtc.c
    u32Reg = RTC->TAMPCTL;

    u32Reg &= ~(RTC_TAMPCTL_DYNSRC_Msk | RTC_TAMPCTL_SEEDRLD_Msk | RTC_TAMPCTL_DYNRATE_Msk);

    u32Reg |= (u32ChangeRate) | ((u32SeedReload & 0x1UL) << RTC_TAMPCTL_SEEDRLD_Pos) |
              (u32RefPattern << RTC_TAMPCTL_DYNSRC_Pos);

    RTC->TAMPSEED = u32Seed; /* need set seed value before re-loade seed */
    RTC->TAMPCTL = u32Reg;
}

/**
  * @brief      Set RTC Clock Source
  *
  * @param[in]  u32ClkSrc       u32ClkSrc is the RTC clock source. It could be
  *                             - \ref RTC_CLOCK_SOURCE_LXT
  *                             - \ref RTC_CLOCK_SOURCE_LIRC
  *                             - \ref RTC_CLOCK_SOURCE_LIRC32K
  *
  * @retval     RTC_CLOCK_SOURCE_LXT
  * @retval     RTC_CLOCK_SOURCE_LIRC
  * @retval     RTC_CLOCK_SOURCE_LIRC32K
  *
  * @details    This API is used to get the setting of RTC clock source.
  *             User must to enable the selected clock source by themselves executing perform this API.
  */
uint32_t RTC_SetClockSource(uint32_t u32ClkSrc)
{
    uint32_t u32TrimDefault = inpw(SYS_BASE + 0x14Cul);

    if(u32ClkSrc == RTC_CLOCK_SOURCE_LXT)
    {
        /* RTC clock source is external LXT */
        RTC->LXTCTL &= ~RTC_LXTCTL_RTCCKSEL_Msk;
        RTC->LXTCTL &= ~RTC_LXTCTL_C32KSEL_Msk;

        return RTC_CLOCK_SOURCE_LXT;
    }
    else if(u32ClkSrc == RTC_CLOCK_SOURCE_LIRC32K)
    {
        /* Load LIRC32 trim setting */
        RTC->LXTCTL = ((RTC->LXTCTL & ~(0x1FFul << 16)) | ((u32TrimDefault & 0x1FFul) << 16));

        /* RTC clock source is LIRC32K */
        RTC->LXTCTL |= RTC_LXTCTL_LIRC32KEN_Msk;
        RTC->LXTCTL &= ~RTC_LXTCTL_RTCCKSEL_Msk;
        RTC->LXTCTL |= RTC_LXTCTL_C32KSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC32K;
    }
    else if(u32ClkSrc == RTC_CLOCK_SOURCE_LIRC)
    {
        /* RTC clock source is LIRC */
        RTC->LXTCTL |= RTC_LXTCTL_RTCCKSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC;
    }
    else
    {
        /* Set the default RTC clock source is LIRC */
        RTC->LXTCTL |= RTC_LXTCTL_RTCCKSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC;
    }
}

/**
 * @brief       Set RTC GPIO Operation Mode
 *
 * @param[in]   u32Pin          The single pin of GPIO-F port.
 *                              It could be 4~11, which means PF.4~PF.11.
 * @param[in]   u32Mode         Operation mode. It could be
 *                              - \ref RTC_IO_MODE_INPUT
 *                              - \ref RTC_IO_MODE_OUTPUT
 *                              - \ref RTC_IO_MODE_OPEN_DRAIN
 *                              - \ref RTC_IO_MODE_QUASI
 * @param[in]   u32DigitalCtl   The digital input path control of specified pin. It could be
 *                              - \ref RTC_IO_DIGITAL_ENABLE
 *                              - \ref RTC_IO_DIGITAL_DISABLE
 * @param[in]   u32PullCtl      The pull-up or pull-down control of specified pin. It could be
 *                              - \ref RTC_IO_PULL_UP_DOWN_DISABLE
 *                              - \ref RTC_IO_PULL_UP_ENABLE
 *                              - \ref RTC_IO_PULL_DOWN_ENABLE
 * @param[in]   u32OutputLevel  The I/O output level. 0: output low; 1: output high.
 *
 * @return      None
 *
 * @details     This function is used to set specified GPIO operation mode controlled by RTC module.
 */
void RTC_SetGPIOMode(uint32_t u32PFPin, uint32_t u32Mode, uint32_t u32DigitalCtl, uint32_t u32PullCtl, uint32_t u32OutputLevel)
{
    uint32_t u32Offset;

    if((u32PFPin == 4) || (u32PFPin == 5) || (u32PFPin == 6) || (u32PFPin == 7))
    {
        u32Offset = u32PFPin - 4;

        RTC_SET_IOCTL_BY_RTC(RTC);

        RTC->GPIOCTL0 = (RTC->GPIOCTL0 & ~(0x3FUL << (u32Offset * 8))) |
                        (u32Mode << (u32Offset * 8)) |
                        (u32OutputLevel << ((u32Offset * 8) + 2)) |
                        (u32DigitalCtl << ((u32Offset * 8) + 3)) |
                        (u32PullCtl << ((u32Offset * 8) + 4));
    }

    if((u32PFPin == 8) || (u32PFPin == 9) || (u32PFPin == 10) || (u32PFPin == 11))
    {
        u32Offset = u32PFPin - 8;

        RTC_SET_IOCTL_BY_RTC(RTC);

        RTC->GPIOCTL1 = (RTC->GPIOCTL1 & ~(0x3FUL << (u32Offset * 8))) |
                        (u32Mode << (u32Offset * 8)) |
                        (u32OutputLevel << ((u32Offset * 8) + 2)) |
                        (u32DigitalCtl << ((u32Offset * 8) + 3)) |
                        (u32PullCtl << ((u32Offset * 8) + 4));
    }
}

/**
 * @brief       Set RTC GPIO Output Level
 *
 * @param[in]   u32Pin          The single pin of GPIO-F port.
 *                              It could be 4~11, which means PF.4~PF.11.
 * @param[in]   u32OutputLevel  The I/O output level. 0: output low; 1: output high.
 *
 * @return      None
 *
 * @details     This function is used to set GPIO output level by RTC module.
 */
void RTC_SetGPIOLevel(uint32_t u32PFPin, uint32_t u32OutputLevel)
{
    uint32_t u32Offset;

    if((u32PFPin == 4) || (u32PFPin == 5) || (u32PFPin == 6) || (u32PFPin == 7))
    {
        u32Offset = u32PFPin - 4;

        RTC->GPIOCTL0 = (RTC->GPIOCTL0 & ~(0x4UL << (u32Offset * 8))) |
                        (u32OutputLevel << ((u32Offset * 8) + 2));
    }

    if((u32PFPin == 8) || (u32PFPin == 9) || (u32PFPin == 10) || (u32PFPin == 11))
    {
        u32Offset = u32PFPin - 8;

        RTC->GPIOCTL1 = (RTC->GPIOCTL1 & ~(0x4UL << (u32Offset * 8))) |
                        (u32OutputLevel << ((u32Offset * 8) + 2));
    }
}

/**@}*/ /* end of group RTC_EXPORTED_FUNCTIONS */

/**@}*/ /* end of group RTC_Driver */

/**@}*/ /* end of group Standard_Driver */
